#В словаре, полученном в задаче 3 удалить все пары ключ/значение для символов, встречающихся менее 5 раз.
a={'y': 19, 'r': 47, 'T': 1, 'I': 3, '!': 3, 'R': 1, 'j': 2, 'x': 1, 'd': 41, 'B': 1, 'a': 52, 'c': 13, 'L': 2, "'": 4, 'm': 20, 'o': 55, 'i': 48, 'G': 1, 's': 42, 'S': 1, '\n': 28, 'W': 1, 'N': 2, ',': 16, ' ': 294, 'q': 1, 'k': 9, '.': 5, 't': 61, ':': 4, 'O': 1, 'F': 1, 'n': 51, 'l': 47, 'v': 6, 'h': 51, ';': 1, '?': 1, 'w': 17, 'g': 15, 'p': 8, 'u': 22, 'e': 102, '-': 9, 'b': 10, 'A': 1, 'Z': 1, 'M': 1, 'f': 16}
b={}
for i in a:
    if a[i]>=5:
        b[i]=a[i]
print(b)