def to_text(number):
    def razr(number):
        return number//10*10, number%10
    dict1={
        0: 'Ноль',
        1: 'Один',
        2: 'Два',
        3: 'Три',
        4: 'Четыре',
        5: 'Пять',
        6: 'Шесть',
        7: 'Семь',
        8: 'Восемь',
        9: 'Девять'
    }
    dict2={
        10: 'Десять',
        11: 'Одиннадцать',
        12: 'Двенадцать',
        13: 'Тринадцать',
        14: 'Четырнадцать',
        15: 'Пятнадцать',
        16: 'Шестнадцать',
        17: 'Семнадцать',
        18: 'Восемнадцать',
        19: 'Девятнадцать'
    }
    dict3={
        20: 'Двадцать',
        30: 'Тридцать',
        40: 'Сорок',
        50: 'Пятьдесят',
        60: 'Шестьдесят',
        70: 'Семьдесят',
        80: 'Восемьдесят',
        90: 'Девяносто'
    }
    if number<20:
        if number<10:
            return dict1[number]
        else:
            return dict2[number]
    else:
        des, edin=razr(number)
        if edin==0:
            return dict3[des]
        else:
            return f'{dict3[des]} {dict1[edin]}'